Table of Contents
 Class GrpcBlobStorageService.GrpcBlobStorageServiceBase
Namespace
IdeaStatiCa.Plugin.Grpc
Assembly
IdeaStatiCa.Plugin.dll
Base class for server-side implementations of GrpcBlobStorageService
[BindServiceMethod(typeof(GrpcBlobStorageService), "BindService")]
public abstract class GrpcBlobStorageService.GrpcBlobStorageServiceBase
Inheritance
object
GrpcBlobStorageService.GrpcBlobStorageServiceBase
Derived
GrpcBlobStorageService
Inherited Members
 object.ToString()
 object.Equals(object)
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetHashCode()
 object.GetType()
 object.MemberwiseClone()
Methods
 Delete(ContentRequest, ServerCallContext)
public virtual Task<VoidResponse> Delete(ContentRequest request, ServerCallContext context)
Parameters
request ContentRequest
context ServerCallContext
Returns
Task<VoidResponse>
 Exist(ContentRequest, ServerCallContext)
public virtual Task<ExistResponse> Exist(ContentRequest request, ServerCallContext context)
Parameters
request ContentRequest
context ServerCallContext
Returns
Task<ExistResponse>
 GetEntries(GetEntriesRequest, ServerCallContext)
public virtual Task<GetEntriesResponse> GetEntries(GetEntriesRequest request, ServerCallContext context)
Parameters
request GetEntriesRequest
context ServerCallContext
Returns
Task<GetEntriesResponse>
 Read(ContentRequest, IServerStreamWriter<ContentData>, ServerCallContext)
public virtual Task Read(ContentRequest request, IServerStreamWriter<ContentData> responseStream, ServerCallContext context)
Parameters
request ContentRequest
responseStream IServerStreamWriter<ContentData>
context ServerCallContext
Returns
Task
 Write(IAsyncStreamReader<ContentData>, ServerCallContext)
blobStorageId and contentId are in metadata
public virtual Task<VoidResponse> Write(IAsyncStreamReader<ContentData> requestStream, ServerCallContext context)
Parameters
requestStream IAsyncStreamReader<ContentData>
Used for reading requests from the client.
context ServerCallContext
The context of the server-side call handler being invoked.
Returns
Task<VoidResponse>
The response to send back to the client (wrapped by a task).
 Edit this page